TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x4_cc26x4/inc/hw_aux_evctl.h
// Field:    [13] MCU_OBSMUX1
//
// Observation input 1 from IOC.
// This event is configured by IOC:OBSAUXOUTPUT.SEL1.
#define AUX_EVCTL_EVSTAT2_MCU_OBSMUX1                               0x00002000
#define AUX_EVCTL_EVSTAT2_MCU_OBSMUX1_BITN                                  13
#define AUX_EVCTL_EVSTAT2_MCU_OBSMUX1_M                             0x00002000
#define AUX_EVCTL_EVSTAT2_MCU_OBSMUX1_S                                     13

// Field:    [12] MCU_OBSMUX0
//
// Observation input 0 from IOC.
// This event is configured by IOC:OBSAUXOUTPUT.SEL0 and can be overridden by
// IOC:OBSAUXOUTPUT.SEL_MISC.
#define AUX_EVCTL_EVSTAT2_MCU_OBSMUX0                               0x00001000
#define AUX_EVCTL_EVSTAT2_MCU_OBSMUX0_BITN                                  12
#define AUX_EVCTL_EVSTAT2_MCU_OBSMUX0_M                             0x00001000
#define AUX_EVCTL_EVSTAT2_MCU_OBSMUX0_S                                     12

// Field:    [11] MCU_EV
//
// Event from EVENT configured by EVENT:AUXSEL0.
#define AUX_EVCTL_EVSTAT2_MCU_EV                                    0x00000800
#define AUX_EVCTL_EVSTAT2_MCU_EV_BITN                                       11
#define AUX_EVCTL_EVSTAT2_MCU_EV_M                                  0x00000800
#define AUX_EVCTL_EVSTAT2_MCU_EV_S                                          11

// Field:    [10] ACLK_REF
//
// TDC reference clock.
// It is configured by DDI_0_OSC:CTL0.ACLK_REF_SRC_SEL and enabled by
// AUX_SYSIF:TDCREFCLKCTL.REQ.
#define AUX_EVCTL_EVSTAT2_ACLK_REF                                  0x00000400
#define AUX_EVCTL_EVSTAT2_ACLK_REF_BITN                                     10
#define AUX_EVCTL_EVSTAT2_ACLK_REF_M                                0x00000400
#define AUX_EVCTL_EVSTAT2_ACLK_REF_S                                        10

// Field:     [9] VDDR_RECHARGE
//
// Event is high during VDDR recharge.
#define AUX_EVCTL_EVSTAT2_VDDR_RECHARGE                             0x00000200
#define AUX_EVCTL_EVSTAT2_VDDR_RECHARGE_BITN                                 9
#define AUX_EVCTL_EVSTAT2_VDDR_RECHARGE_M                           0x00000200
#define AUX_EVCTL_EVSTAT2_VDDR_RECHARGE_S                                    9

// Field:     [8] MCU_ACTIVE
//
// Event is high while system(MCU, AUX, or JTAG domains) is active or
// transitions to active (GLDO or DCDC power supply state). Event is not high
// during VDDR recharge.
#define AUX_EVCTL_EVSTAT2_MCU_ACTIVE                                0x00000100
#define AUX_EVCTL_EVSTAT2_MCU_ACTIVE_BITN                                    8
#define AUX_EVCTL_EVSTAT2_MCU_ACTIVE_M                              0x00000100
#define AUX_EVCTL_EVSTAT2_MCU_ACTIVE_S                                       8

// Field:     [7] PWR_DWN
//
// Event is high while system(MCU, AUX, or JTAG domains) is in powerdown (uLDO
// power supply).
#define AUX_EVCTL_EVSTAT2_PWR_DWN                                   0x00000080
#define AUX_EVCTL_EVSTAT2_PWR_DWN_BITN                                       7
#define AUX_EVCTL_EVSTAT2_PWR_DWN_M                                 0x00000080
#define AUX_EVCTL_EVSTAT2_PWR_DWN_S                                          7

// Field:     [6] SCLK_LF
//
// SCLK_LF clock
#define AUX_EVCTL_EVSTAT2_SCLK_LF                                   0x00000040
#define AUX_EVCTL_EVSTAT2_SCLK_LF_BITN                                       6
#define AUX_EVCTL_EVSTAT2_SCLK_LF_M                                 0x00000040
#define AUX_EVCTL_EVSTAT2_SCLK_LF_S                                          6

// Field:     [5] AON_BATMON_TEMP_UPD
//
// Event is high for two SCLK_MF clock periods when there is an update of
// AON_BATMON:TEMP.
#define AUX_EVCTL_EVSTAT2_AON_BATMON_TEMP_UPD                       0x00000020
#define AUX_EVCTL_EVSTAT2_AON_BATMON_TEMP_UPD_BITN                           5
#define AUX_EVCTL_EVSTAT2_AON_BATMON_TEMP_UPD_M                     0x00000020
#define AUX_EVCTL_EVSTAT2_AON_BATMON_TEMP_UPD_S                              5

// Field:     [4] AON_BATMON_BAT_UPD
//
// Event is high for two SCLK_MF clock periods when there is an update of
// AON_BATMON:BAT.
#define AUX_EVCTL_EVSTAT2_AON_BATMON_BAT_UPD                        0x00000010
#define AUX_EVCTL_EVSTAT2_AON_BATMON_BAT_UPD_BITN                            4
#define AUX_EVCTL_EVSTAT2_AON_BATMON_BAT_UPD_M                      0x00000010
#define AUX_EVCTL_EVSTAT2_AON_BATMON_BAT_UPD_S                               4

// Field:     [3] AON_RTC_4KHZ
//
// AON_RTC:SUBSEC.VALUE bit 19.
// AON_RTC:CTL.RTC_4KHZ_EN enables this event.
#define AUX_EVCTL_EVSTAT2_AON_RTC_4KHZ                              0x00000008
#define AUX_EVCTL_EVSTAT2_AON_RTC_4KHZ_BITN                                  3
#define AUX_EVCTL_EVSTAT2_AON_RTC_4KHZ_M                            0x00000008
#define AUX_EVCTL_EVSTAT2_AON_RTC_4KHZ_S                                     3

// Field:     [2] AON_RTC_CH2_DLY
//
// AON_RTC:EVFLAGS.CH2 delayed by AON_RTC:CTL.EV_DELAY configuration.
#define AUX_EVCTL_EVSTAT2_AON_RTC_CH2_DLY                           0x00000004
#define AUX_EVCTL_EVSTAT2_AON_RTC_CH2_DLY_BITN                               2
#define AUX_EVCTL_EVSTAT2_AON_RTC_CH2_DLY_M                         0x00000004
#define AUX_EVCTL_EVSTAT2_AON_RTC_CH2_DLY_S                                  2

// Field:     [1] AON_RTC_CH2
//
// AON_RTC:EVFLAGS.CH2.
#define AUX_EVCTL_EVSTAT2_AON_RTC_CH2                               0x00000002
#define AUX_EVCTL_EVSTAT2_AON_RTC_CH2_BITN                                   1
#define AUX_EVCTL_EVSTAT2_AON_RTC_CH2_M                             0x00000002
#define AUX_EVCTL_EVSTAT2_AON_RTC_CH2_S                                      1

// Field:     [0] MANUAL_EV
//
// Programmable event. See MANUAL for description.
#define AUX_EVCTL_EVSTAT2_MANUAL_EV                                 0x00000001
#define AUX_EVCTL_EVSTAT2_MANUAL_EV_BITN                                     0
#define AUX_EVCTL_EVSTAT2_MANUAL_EV_M                               0x00000001
#define AUX_EVCTL_EVSTAT2_MANUAL_EV_S                                        0

//*****************************************************************************
//
// Register: AUX_EVCTL_O_EVSTAT3
//
//*****************************************************************************
// Field:    [15] AUX_TIMER2_CLKSWITCH_RDY
//
// AUX_SYSIF:TIMER2CLKSWITCH.RDY
#define AUX_EVCTL_EVSTAT3_AUX_TIMER2_CLKSWITCH_RDY                  0x00008000
#define AUX_EVCTL_EVSTAT3_AUX_TIMER2_CLKSWITCH_RDY_BITN                     15
#define AUX_EVCTL_EVSTAT3_AUX_TIMER2_CLKSWITCH_RDY_M                0x00008000
#define AUX_EVCTL_EVSTAT3_AUX_TIMER2_CLKSWITCH_RDY_S                        15

// Field:    [14] AUX_DAC_HOLD_ACTIVE
//
// AUX_ANAIF:DACSTAT.HOLD_ACTIVE
#define AUX_EVCTL_EVSTAT3_AUX_DAC_HOLD_ACTIVE                       0x00004000
#define AUX_EVCTL_EVSTAT3_AUX_DAC_HOLD_ACTIVE_BITN                          14
#define AUX_EVCTL_EVSTAT3_AUX_DAC_HOLD_ACTIVE_M                     0x00004000
#define AUX_EVCTL_EVSTAT3_AUX_DAC_HOLD_ACTIVE_S                             14

