TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x4_cc26x4/inc/hw_aux_evctl.h
// Field:     [0] SEL
//
// Select FIFO watermark level required to trigger a UDMA0 transfer of ADC FIFO
// data.
// ENUMs:
// AUX_ADC_FIFO_ALMOST_FULL UDMA0 trigger event will be generated when the ADC
//                          FIFO is almost full (3/4 full).
// AUX_ADC_FIFO_NOT_EMPTY   UDMA0 trigger event will be generated when there
//                          are samples in the ADC FIFO.
#define AUX_EVCTL_DMACTL_SEL                                        0x00000001
#define AUX_EVCTL_DMACTL_SEL_BITN                                            0
#define AUX_EVCTL_DMACTL_SEL_M                                      0x00000001
#define AUX_EVCTL_DMACTL_SEL_S                                               0
#define AUX_EVCTL_DMACTL_SEL_AUX_ADC_FIFO_ALMOST_FULL               0x00000001
#define AUX_EVCTL_DMACTL_SEL_AUX_ADC_FIFO_NOT_EMPTY                 0x00000000

//*****************************************************************************
//
// Register: AUX_EVCTL_O_SWEVSET
//
//*****************************************************************************
// Field:     [2] SWEV2
//
// Software event flag 2.
//
// 0: No effect.
// 1: Set software event flag 2.
#define AUX_EVCTL_SWEVSET_SWEV2                                     0x00000004
#define AUX_EVCTL_SWEVSET_SWEV2_BITN                                         2
#define AUX_EVCTL_SWEVSET_SWEV2_M                                   0x00000004
#define AUX_EVCTL_SWEVSET_SWEV2_S                                            2

// Field:     [1] SWEV1
//
// Software event flag 1.
//
// 0: No effect.
// 1: Set software event flag 1.
#define AUX_EVCTL_SWEVSET_SWEV1                                     0x00000002
#define AUX_EVCTL_SWEVSET_SWEV1_BITN                                         1
#define AUX_EVCTL_SWEVSET_SWEV1_M                                   0x00000002
#define AUX_EVCTL_SWEVSET_SWEV1_S                                            1

// Field:     [0] SWEV0
//
// Software event flag 0.
//
// 0: No effect.
// 1: Set software event flag 0.
#define AUX_EVCTL_SWEVSET_SWEV0                                     0x00000001
#define AUX_EVCTL_SWEVSET_SWEV0_BITN                                         0
#define AUX_EVCTL_SWEVSET_SWEV0_M                                   0x00000001
#define AUX_EVCTL_SWEVSET_SWEV0_S                                            0

//*****************************************************************************
//
// Register: AUX_EVCTL_O_EVTOAONFLAGS
//
//*****************************************************************************
// Field:     [8] AUX_TIMER1_EV
//
// This event flag is set when level selected by EVTOAONPOL.AUX_TIMER1_EV
// occurs on EVSTAT3.AUX_TIMER1_EV.
#define AUX_EVCTL_EVTOAONFLAGS_AUX_TIMER1_EV                        0x00000100
#define AUX_EVCTL_EVTOAONFLAGS_AUX_TIMER1_EV_BITN                            8
#define AUX_EVCTL_EVTOAONFLAGS_AUX_TIMER1_EV_M                      0x00000100
#define AUX_EVCTL_EVTOAONFLAGS_AUX_TIMER1_EV_S                               8

// Field:     [7] AUX_TIMER0_EV
//
// This event flag is set when level selected by EVTOAONPOL.AUX_TIMER0_EV
// occurs on EVSTAT3.AUX_TIMER0_EV.
#define AUX_EVCTL_EVTOAONFLAGS_AUX_TIMER0_EV                        0x00000080
#define AUX_EVCTL_EVTOAONFLAGS_AUX_TIMER0_EV_BITN                            7
#define AUX_EVCTL_EVTOAONFLAGS_AUX_TIMER0_EV_M                      0x00000080
#define AUX_EVCTL_EVTOAONFLAGS_AUX_TIMER0_EV_S                               7

// Field:     [6] AUX_TDC_DONE
//
// This event flag is set when level selected by EVTOAONPOL.AUX_TDC_DONE occurs
// on EVSTAT3.AUX_TDC_DONE.
#define AUX_EVCTL_EVTOAONFLAGS_AUX_TDC_DONE                         0x00000040
#define AUX_EVCTL_EVTOAONFLAGS_AUX_TDC_DONE_BITN                             6
#define AUX_EVCTL_EVTOAONFLAGS_AUX_TDC_DONE_M                       0x00000040
#define AUX_EVCTL_EVTOAONFLAGS_AUX_TDC_DONE_S                                6

// Field:     [5] AUX_ADC_DONE
//
// This event flag is set when level selected by EVTOAONPOL.AUX_ADC_DONE occurs
// on EVSTAT3.AUX_ADC_DONE.
#define AUX_EVCTL_EVTOAONFLAGS_AUX_ADC_DONE                         0x00000020
#define AUX_EVCTL_EVTOAONFLAGS_AUX_ADC_DONE_BITN                             5
#define AUX_EVCTL_EVTOAONFLAGS_AUX_ADC_DONE_M                       0x00000020
#define AUX_EVCTL_EVTOAONFLAGS_AUX_ADC_DONE_S                                5

// Field:     [4] AUX_COMPB
//
// This event flag is set when edge selected by EVTOAONPOL.AUX_COMPB occurs on
// EVSTAT2.AUX_COMPB.
#define AUX_EVCTL_EVTOAONFLAGS_AUX_COMPB                            0x00000010
#define AUX_EVCTL_EVTOAONFLAGS_AUX_COMPB_BITN                                4
#define AUX_EVCTL_EVTOAONFLAGS_AUX_COMPB_M                          0x00000010
#define AUX_EVCTL_EVTOAONFLAGS_AUX_COMPB_S                                   4

// Field:     [3] AUX_COMPA
//
// This event flag is set when edge selected by EVTOAONPOL.AUX_COMPA occurs on
// EVSTAT2.AUX_COMPA.
#define AUX_EVCTL_EVTOAONFLAGS_AUX_COMPA                            0x00000008
#define AUX_EVCTL_EVTOAONFLAGS_AUX_COMPA_BITN                                3
#define AUX_EVCTL_EVTOAONFLAGS_AUX_COMPA_M                          0x00000008
#define AUX_EVCTL_EVTOAONFLAGS_AUX_COMPA_S                                   3

// Field:     [2] SWEV2
//
// This event flag is set when software writes a 1 to SWEVSET.SWEV2.
#define AUX_EVCTL_EVTOAONFLAGS_SWEV2                                0x00000004
#define AUX_EVCTL_EVTOAONFLAGS_SWEV2_BITN                                    2
#define AUX_EVCTL_EVTOAONFLAGS_SWEV2_M                              0x00000004
#define AUX_EVCTL_EVTOAONFLAGS_SWEV2_S                                       2

// Field:     [1] SWEV1
//
// This event flag is set when software writes a 1 to SWEVSET.SWEV1.
#define AUX_EVCTL_EVTOAONFLAGS_SWEV1                                0x00000002
#define AUX_EVCTL_EVTOAONFLAGS_SWEV1_BITN                                    1
#define AUX_EVCTL_EVTOAONFLAGS_SWEV1_M                              0x00000002
#define AUX_EVCTL_EVTOAONFLAGS_SWEV1_S                                       1

// Field:     [0] SWEV0
//
// This event flag is set when software writes a 1 to SWEVSET.SWEV0.
#define AUX_EVCTL_EVTOAONFLAGS_SWEV0                                0x00000001
#define AUX_EVCTL_EVTOAONFLAGS_SWEV0_BITN                                    0
#define AUX_EVCTL_EVTOAONFLAGS_SWEV0_M                              0x00000001
#define AUX_EVCTL_EVTOAONFLAGS_SWEV0_S                                       0

//*****************************************************************************
//
// Register: AUX_EVCTL_O_EVTOAONPOL
//
//*****************************************************************************
// Field:     [8] AUX_TIMER1_EV
//
// Select the level of EVSTAT3.AUX_TIMER1_EV that sets
// EVTOAONFLAGS.AUX_TIMER1_EV.
// ENUMs:
// LOW                      Low level
// HIGH                     High level
#define AUX_EVCTL_EVTOAONPOL_AUX_TIMER1_EV                          0x00000100
#define AUX_EVCTL_EVTOAONPOL_AUX_TIMER1_EV_BITN                              8
#define AUX_EVCTL_EVTOAONPOL_AUX_TIMER1_EV_M                        0x00000100
#define AUX_EVCTL_EVTOAONPOL_AUX_TIMER1_EV_S                                 8
#define AUX_EVCTL_EVTOAONPOL_AUX_TIMER1_EV_LOW                      0x00000100
#define AUX_EVCTL_EVTOAONPOL_AUX_TIMER1_EV_HIGH                     0x00000000

// Field:     [7] AUX_TIMER0_EV
//
// Select the level of EVSTAT3.AUX_TIMER0_EV that sets
// EVTOAONFLAGS.AUX_TIMER0_EV.
// ENUMs:
// LOW                      Low level
// HIGH                     High level
#define AUX_EVCTL_EVTOAONPOL_AUX_TIMER0_EV                          0x00000080
#define AUX_EVCTL_EVTOAONPOL_AUX_TIMER0_EV_BITN                              7
#define AUX_EVCTL_EVTOAONPOL_AUX_TIMER0_EV_M                        0x00000080
#define AUX_EVCTL_EVTOAONPOL_AUX_TIMER0_EV_S                                 7
#define AUX_EVCTL_EVTOAONPOL_AUX_TIMER0_EV_LOW                      0x00000080
#define AUX_EVCTL_EVTOAONPOL_AUX_TIMER0_EV_HIGH                     0x00000000

// Field:     [6] AUX_TDC_DONE
//
// Select level of EVSTAT3.AUX_TDC_DONE that sets EVTOAONFLAGS.AUX_TDC_DONE.
// ENUMs:
// LOW                      Low level
// HIGH                     High level
#define AUX_EVCTL_EVTOAONPOL_AUX_TDC_DONE                           0x00000040
#define AUX_EVCTL_EVTOAONPOL_AUX_TDC_DONE_BITN                               6
#define AUX_EVCTL_EVTOAONPOL_AUX_TDC_DONE_M                         0x00000040
#define AUX_EVCTL_EVTOAONPOL_AUX_TDC_DONE_S                                  6
#define AUX_EVCTL_EVTOAONPOL_AUX_TDC_DONE_LOW                       0x00000040
#define AUX_EVCTL_EVTOAONPOL_AUX_TDC_DONE_HIGH                      0x00000000

// Field:     [5] AUX_ADC_DONE
//
// Select the level of  EVSTAT3.AUX_ADC_DONE that sets
// EVTOAONFLAGS.AUX_ADC_DONE.
// ENUMs:
// LOW                      Low level
// HIGH                     High level
#define AUX_EVCTL_EVTOAONPOL_AUX_ADC_DONE                           0x00000020
#define AUX_EVCTL_EVTOAONPOL_AUX_ADC_DONE_BITN                               5
#define AUX_EVCTL_EVTOAONPOL_AUX_ADC_DONE_M                         0x00000020
#define AUX_EVCTL_EVTOAONPOL_AUX_ADC_DONE_S                                  5
#define AUX_EVCTL_EVTOAONPOL_AUX_ADC_DONE_LOW                       0x00000020
#define AUX_EVCTL_EVTOAONPOL_AUX_ADC_DONE_HIGH                      0x00000000

// Field:     [4] AUX_COMPB
//
// Select the edge of  EVSTAT2.AUX_COMPB that sets EVTOAONFLAGS.AUX_COMPB.
// ENUMs:
// FALL                     Falling edge
// RISE                     Rising edge
#define AUX_EVCTL_EVTOAONPOL_AUX_COMPB                              0x00000010
#define AUX_EVCTL_EVTOAONPOL_AUX_COMPB_BITN                                  4
#define AUX_EVCTL_EVTOAONPOL_AUX_COMPB_M                            0x00000010
#define AUX_EVCTL_EVTOAONPOL_AUX_COMPB_S                                     4
#define AUX_EVCTL_EVTOAONPOL_AUX_COMPB_FALL                         0x00000010
#define AUX_EVCTL_EVTOAONPOL_AUX_COMPB_RISE                         0x00000000

