TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x4_cc26x4/inc/hw_aux_evctl.h
// Field:     [3] AUX_COMPA
//
// Select the edge of  EVSTAT2.AUX_COMPA that sets EVTOAONFLAGS.AUX_COMPA.
// ENUMs:
// FALL                     Falling edge
// RISE                     Rising edge
#define AUX_EVCTL_EVTOAONPOL_AUX_COMPA                              0x00000008
#define AUX_EVCTL_EVTOAONPOL_AUX_COMPA_BITN                                  3
#define AUX_EVCTL_EVTOAONPOL_AUX_COMPA_M                            0x00000008
#define AUX_EVCTL_EVTOAONPOL_AUX_COMPA_S                                     3
#define AUX_EVCTL_EVTOAONPOL_AUX_COMPA_FALL                         0x00000008
#define AUX_EVCTL_EVTOAONPOL_AUX_COMPA_RISE                         0x00000000

//*****************************************************************************
//
// Register: AUX_EVCTL_O_EVTOAONFLAGSCLR
//
//*****************************************************************************
// Field:     [8] AUX_TIMER1_EV
//
// Write 1 to clear EVTOAONFLAGS.AUX_TIMER1_EV.
//
// Read value is 0.
#define AUX_EVCTL_EVTOAONFLAGSCLR_AUX_TIMER1_EV                     0x00000100
#define AUX_EVCTL_EVTOAONFLAGSCLR_AUX_TIMER1_EV_BITN                         8
#define AUX_EVCTL_EVTOAONFLAGSCLR_AUX_TIMER1_EV_M                   0x00000100
#define AUX_EVCTL_EVTOAONFLAGSCLR_AUX_TIMER1_EV_S                            8

// Field:     [7] AUX_TIMER0_EV
//
// Write 1 to clear EVTOAONFLAGS.AUX_TIMER0_EV.
//
// Read value is 0.
#define AUX_EVCTL_EVTOAONFLAGSCLR_AUX_TIMER0_EV                     0x00000080
#define AUX_EVCTL_EVTOAONFLAGSCLR_AUX_TIMER0_EV_BITN                         7
#define AUX_EVCTL_EVTOAONFLAGSCLR_AUX_TIMER0_EV_M                   0x00000080
#define AUX_EVCTL_EVTOAONFLAGSCLR_AUX_TIMER0_EV_S                            7

// Field:     [6] AUX_TDC_DONE
//
// Write 1 to clear EVTOAONFLAGS.AUX_TDC_DONE.
//
// Read value is 0.
#define AUX_EVCTL_EVTOAONFLAGSCLR_AUX_TDC_DONE                      0x00000040
#define AUX_EVCTL_EVTOAONFLAGSCLR_AUX_TDC_DONE_BITN                          6
#define AUX_EVCTL_EVTOAONFLAGSCLR_AUX_TDC_DONE_M                    0x00000040
#define AUX_EVCTL_EVTOAONFLAGSCLR_AUX_TDC_DONE_S                             6

// Field:     [5] AUX_ADC_DONE
//
// Write 1 to clear EVTOAONFLAGS.AUX_ADC_DONE.
//
// Read value is 0.
#define AUX_EVCTL_EVTOAONFLAGSCLR_AUX_ADC_DONE                      0x00000020
#define AUX_EVCTL_EVTOAONFLAGSCLR_AUX_ADC_DONE_BITN                          5
#define AUX_EVCTL_EVTOAONFLAGSCLR_AUX_ADC_DONE_M                    0x00000020
#define AUX_EVCTL_EVTOAONFLAGSCLR_AUX_ADC_DONE_S                             5

// Field:     [4] AUX_COMPB
//
// Write 1 to clear EVTOAONFLAGS.AUX_COMPB.
//
// Read value is 0.
#define AUX_EVCTL_EVTOAONFLAGSCLR_AUX_COMPB                         0x00000010
#define AUX_EVCTL_EVTOAONFLAGSCLR_AUX_COMPB_BITN                             4
#define AUX_EVCTL_EVTOAONFLAGSCLR_AUX_COMPB_M                       0x00000010
#define AUX_EVCTL_EVTOAONFLAGSCLR_AUX_COMPB_S                                4

// Field:     [3] AUX_COMPA
//
// Write 1 to clear EVTOAONFLAGS.AUX_COMPA.
//
// Read value is 0.
#define AUX_EVCTL_EVTOAONFLAGSCLR_AUX_COMPA                         0x00000008
#define AUX_EVCTL_EVTOAONFLAGSCLR_AUX_COMPA_BITN                             3
#define AUX_EVCTL_EVTOAONFLAGSCLR_AUX_COMPA_M                       0x00000008
#define AUX_EVCTL_EVTOAONFLAGSCLR_AUX_COMPA_S                                3

// Field:     [2] SWEV2
//
// Write 1 to clear EVTOAONFLAGS.SWEV2.
//
// Read value is 0.
#define AUX_EVCTL_EVTOAONFLAGSCLR_SWEV2                             0x00000004
#define AUX_EVCTL_EVTOAONFLAGSCLR_SWEV2_BITN                                 2
#define AUX_EVCTL_EVTOAONFLAGSCLR_SWEV2_M                           0x00000004
#define AUX_EVCTL_EVTOAONFLAGSCLR_SWEV2_S                                    2

// Field:     [1] SWEV1
//
// Write 1 to clear EVTOAONFLAGS.SWEV1.
//
// Read value is 0.
#define AUX_EVCTL_EVTOAONFLAGSCLR_SWEV1                             0x00000002
#define AUX_EVCTL_EVTOAONFLAGSCLR_SWEV1_BITN                                 1
#define AUX_EVCTL_EVTOAONFLAGSCLR_SWEV1_M                           0x00000002
#define AUX_EVCTL_EVTOAONFLAGSCLR_SWEV1_S                                    1

// Field:     [0] SWEV0
//
// Write 1 to clear EVTOAONFLAGS.SWEV0.
//
// Read value is 0.
#define AUX_EVCTL_EVTOAONFLAGSCLR_SWEV0                             0x00000001
#define AUX_EVCTL_EVTOAONFLAGSCLR_SWEV0_BITN                                 0
#define AUX_EVCTL_EVTOAONFLAGSCLR_SWEV0_M                           0x00000001
#define AUX_EVCTL_EVTOAONFLAGSCLR_SWEV0_S                                    0

//*****************************************************************************
//
// Register: AUX_EVCTL_O_EVTOMCUFLAGS
//
//*****************************************************************************
// Field:    [15] AUX_TIMER2_PULSE
//
// This event flag is set when level selected by EVTOMCUPOL.AUX_TIMER2_PULSE
// occurs on EVSTAT3.AUX_TIMER2_PULSE.
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_TIMER2_PULSE                     0x00008000
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_TIMER2_PULSE_BITN                        15
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_TIMER2_PULSE_M                   0x00008000
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_TIMER2_PULSE_S                           15

// Field:    [14] AUX_TIMER2_EV3
//
// This event flag is set when level selected by EVTOMCUPOL.AUX_TIMER2_EV3
// occurs on EVSTAT3.AUX_TIMER2_EV3.
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_TIMER2_EV3                       0x00004000
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_TIMER2_EV3_BITN                          14
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_TIMER2_EV3_M                     0x00004000
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_TIMER2_EV3_S                             14

// Field:    [13] AUX_TIMER2_EV2
//
// This event flag is set when level selected by EVTOMCUPOL.AUX_TIMER2_EV2
// occurs on EVSTAT3.AUX_TIMER2_EV2.
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_TIMER2_EV2                       0x00002000
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_TIMER2_EV2_BITN                          13
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_TIMER2_EV2_M                     0x00002000
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_TIMER2_EV2_S                             13

